import React from 'react';
import {Text, ScrollView, View, StyleSheet, Image, TouchableOpacity} from 'react-native';
import { useNavigation } from '@react-navigation/native';


const Terms = ({}) => {

  const navigation = useNavigation();

  const backfunc = () => {
    navigation.goBack();
  }

      return (
        <View style={styles.containerWrapper}>
        <View style={{flexDirection:'row', marginVertical:20, marginHorizontal:18}}>
                <TouchableOpacity style={{marginRight:18}} onPress={backfunc}>
                    <Image style={{width:24, height:24}} source={require('../../images/back.png')} />
                </TouchableOpacity>
                <Text style={{fontWeight:'bold', fontSize:18, color:'dimgrey'}}>Terms & Conditions</Text>
        </View>
        <ScrollView style={styles.scroll}>
          <Text h1>Ι. Οροι Χρήσης {'\n'}{'\n'}</Text>

          <Text h4>ΠΑΡΕΧΟΜΕΝΗ ΥΠΗΡΕΣΙΑ</Text>
          <Text>H BackTogether (εφεξής "Η Εταιρία") αναλαμβάνει αποκλειστικά την έκδοση διαβατηρίων ανοσίας (π.χ. COVID-19 ή τεστ αντισωμάτων) (και παρέχει έναν τρόπο επικύρωσης αυτων των διαβατηριων, που παρουσιάζονται μέσω της εφαρμογής της).
            Τα τεστ (διαβατηρία) διεξαγονται αποκλειστικά από τρίτους (εφεξής "Τρίτους Παρόχους") (π.χ. κέντρα υγείας, εξουσιοδοτημένες κλινικές), σύμφωνα με τους όρους και τις
            προϋποθέσεις που αυτοί, δηλαδή οι Τρίτοι Πάροχοι, διαμορφώνουν και γνωστοποιούν στο
            ευρύ κοινό.</Text>
          <Text h4>{'\n'}ΧΡΕΩΣΕΙΣ</Text>
          <Text>
            Το κόστος κάθε έκδοσης διαβατηρίου καθορίζεται από τον
            αντίστοιχο Τρίτο Πάροχο και συμπεριλαμβάνεται στην αμοιβή των Τρίτων Παρόχων για τις υπηρεσίες που παρέχουν.

          </Text>

          <Text h4>{'\n'}ΔΙΑΔΙΚΑΣΙΑ ΑΓΟΡΑΣ</Text>
          <Text>
            Η διαδικασία αγοράς τεστ δεν λαμβάνει χώρα μέσω της εφαρμογής της Εταιρίας αλλά απο τον Τρίτο Πάροχο. Συνεπώς,
            η Εταιρία δεν συναλλάσσεται άμεσα με τους πελάτες, αλλά είναι συνεργάτης των Τρίτων Παρόχων σύμφωνα με τις ειδικότερες συμφωνίες που διέπουν τις εν λόγω συνεργασίες.
            Γι' αυτό η Εταιρία ουδεμία ευθύνη φέρει για τη διαμόρφωση ή/και τις μεταβολές των τιμών των υπηρεσιών των Τρίτων Παρόχων.

          </Text>
          <Text h4>ΕΠΙΣΤΡΟΦΗ ΧΡΗΜΑΤΩΝ</Text>
          <Text>
            Εφοσον η Εταιρία δεν συναλλάσσεται άμεσα με τον Πελάτη, δεν τίθεται ζήτημα επιστροφής χρημάτων, αφού παρέχει τις υπρεσίες της ως συνεργάτης των Τρίτων Παρόχων. Κάθε σχετική διαφορά πρέπει να επιλύεται με τους Τρίτους Παρόχους, ενώ η Εταιρία ουδεμία σχετική ευθύνη φέρει.
          </Text>
          <Text h4>{'\n'}ΠΡΟΣΒΑΣΗ ΣΤΑ ΔΙΑΒΑΤΗΡΙΑ ΑΝΟΣΙΑΣ</Text>
          <Text style={styles.marginBottom}>Για την πρόσβαση στα διαβατήρια ανοσίας ο πελάτης απαιτείται να έχει ηλεκτρονική φορητή
            συσκευή (π.χ. κινητό τηλέφωνο, τάμπλετ) με εγκατεστημένη την εφαρμογή BackTogether.

            Επίσης, για την πρόσβαση στα διαβατήρια (αποτελέσματα από τα τεστ) απαιτείται η εγγραφή του πελάτη στην εφαρμογή που είναι δυνατή
            με τρεις τρόπους:{'\n'}
            α. με τη χρήση του Google λογαριασμού του,  αποδεχόμενος την επεξεργασία των αναγκαίων
            προσωπικών δεδομένων που παρέχονται από την εν λόγω πλατφόρμα (η οποία θα είναι σύντομα διαθέσιμη){'\n'}
            β. τη χρήση του Facebook λογαριασμού του, αποδεχόμενος την επεξεργασία των αναγκαίων
            προσωπικών δεδομένων που παρέχονται από την εν λόγω πλατφόρμα κοινωνικής δικτύωσης (η οποία θα είναι σύντομα διαθέσιμη),{'\n'}
            γ. με τη χρήση της διεύθυνσης ηλεκτρονικού ταχυδρομείου του. Στην τελευταία αυτή
            περίπτωση αποστέλλεται σχετικό email στον πελάτη, ο οποίος πρέπει να χρησιμοποιησει τον κωδικο
            που περιέχεται μέσα σε αυτό, προκειμένου να ολοκληρωθεί η εγγραφή.{'\n'}
            {'\n'}

            Με την εισαγωγή των στοιχείων του λογαριασμού
            του, θα εμφανίζεται το ηλεκτρονικό του διαβατηριο σε μορφή QR Code καθως και όλων των λοιπών πληροφοριών του τεστ.
            {'\n'}{'\n'}
            Για τη σύνδεση στην εφαρμογή και την εμφάνιση του διαβατηρίου στη φορητή
            συσκευή απαιτείται σύνδεση στο διαδίκτυο. Από τη στιγμή που το εισιτήριο έχει μεταφερθεί
            στη συσκευή δεν απαιτείται πλέον σύνδεση στο διαδίκτυο.
            {'\n'}.</Text>

          </ScrollView>
        </View>
      );
}

export default Terms;

const styles = StyleSheet.create({
  containerWrapper:{
    display: 'flex',
    backgroundColor:'#efeff5',
    flex: 1
  },
  scroll : {
    backgroundColor:'white',
    marginHorizontal:18,
    marginVertical:20,
    borderRadius:10,
    paddingHorizontal:18,
    paddingVertical:18
  },
  container: {
    backgroundColor: "#EFEFF5",
    paddingHorizontal: 20,
    overflow: "hidden",
    height: 100,
    marginBottom: 30,
    display: 'flex',
  },
  marginBottom: {
    marginBottom: 20
  }
});
